[
  {
    "id": 1,
    "title": "مقدمة في لغة الجافا سكريبت",
    "data": "لغة الجافا سكريبت هي لغة برمجة تستخدم عادة في تطوير الويب. تتيح إنشاء محتوى تفاعلي وديناميكي على مواقع الويب",
    "category": "البرمجة",
    "details": "تم إنشاء لغة الجافا سكريبت من قبل بريندان إيك أثناء عمله في شركة نتسكيب كوميونيكيشنز كوربوريشن. تم إطلاقها لأول مرة في عام 1995 ومنذ ذلك الحين أصبحت واحدة من أكثر لغات البرمجة شيوعًا في العالم. يتم استخدام لغة الجافا سكريبت في الأساس لتطوير الويب في الجانب العميل، ولكن يمكن استخدامها أيضًا لتطوير الجانب الخادم (Node.js) وتطوير تطبيقات الهواتف المحمولة (React Native)."
  },
  {
    "id": 2,
    "title": "أساسيات HTML",
    "data": "HTML (لغة ترميز النص التشعبي) هي لغة ترميز معيارية لإنشاء صفحات الويب. يوفر هيكلًا ومحتوى لصفحة الويب",
    "category": "تطوير الويب",
    "details": "تم إنشاء HTML بواسطة تيم برنرز-لي في عام 1991 كطريقة لمشاركة المستندات إلكترونيًا. إنها الأساس للشبكة العنكبوتية العالمية وتُستخدم لإنشاء هيكل الصفحة الإلكترونية. يتكون HTML من سلسلة من العناصر، يمثل كل منها بزوج من الوسوم، والتي تحدد الهيكل والمحتوى للصفحة."
  },
  {
    "id": 3,
    "title": "تنسيق CSS",
    "data": "تُستخدم CSS (ورقة أنماط التنسيق) لتنسيق عناصر HTML. يسمح بتخصيص مظهر وتخطيط صفحة الويب",
    "category": "تصميم الويب",
    "details": "اقترح CSS من قبل هاكون ويوم لي في عام 1994 ومنذ ذلك الحين أصبح جزءًا أساسيًا من تصميم الويب. يتيح للمطورين فصل محتوى صفحة الويب عن عرضه، مما يجعل من السهل الصيانة والتحديث. يوفر CSS مجموعة واسعة من خيارات التنسيق، بما في ذلك الألوان والخطوط والهوامش والرسوم المتحركة."
  },
  {
    "id": 4,
    "title": "أساسيات React.js",
    "data": "React.js هي مكتبة JavaScript لبناء واجهات المستخدم. يمكنها إنشاء مكونات واجهة المستخدم التي يمكن إعادة استخدامها",
    "category": "تطوير الواجهة الأمامية",
    "details": "تم تطوير React.js من قبل فيسبوك وطرحه كمشروع مفتوح المصدر في عام 2013. غالبًا ما تُستخدم لبناء تطبيقات الصفحة الواحدة وتُعرف ببنيتها المستندة إلى المكونات والنموذج الظاهري. يتيح React للمطورين إنشاء مكونات واجهة مستخدم قابلة لإعادة الاستخدام، التي يمكن تكوينها معًا لبناء واجهات مستخدم معقدة."
  },
  {
    "id": 5,
    "title": "أساسيات Node.js",
    "data": "Node.js هو بيئة تشغيل JavaScript تم بناؤها على محرك JavaScript V8 الخاص بمتصفح Chrome. يسمح بالبرمجة على الجانب الخادم وتطبيقات الشبكات",
    "category": "تطوير الواجهة الخلفية",
    "details": "تم إنشاء Node.js من قبل ريان دال في عام 2009 وهو مصمم لبناء تطبيقات الشبكات قابلة للتوسيع. يستخدم نموذج الإدخال والإخراج غير المانع والمدعوم بالأحداث، مما يجعله خفيف الوزن وفعالًا. يتم استخدام Node.js عادةً لبناء خوادم الويب وخوادم واجهة برمجة التطبيقات (API) وتطبيقات الوقت الحقيقي."
  },
  {
    "id": 6,
    "title": "مقدمة في هياكل البيانات",
    "data": "تُعتبر هياكل البيانات طرقًا لتنظيم وتخزين البيانات في الحاسوب. إنها أساسية للتلاعب والتخزين الفعال للبيانات",
    "category": "البرمجة",
    "details": "هياكل البيانات هي مفاهيم أساسية في علوم الكمبيوتر وتُستخدم لتنظيم وتلاعب البيانات بكفاءة. تشمل هياكل البيانات الشائعة الأنماط المصفوفة، والقوائم المرتبطة، والمكدسات، والطوابير، والأشجار، والرسوم البيانية. لكل هيكل بيانات ميزاته وحالات استخدامه الخاصة، وفهمها أمر أساسي لكتابة خوارزميات وبرامج فعالة."
  },
  {
    "id": 7,
    "title": "مقدمة في الخوارزميات",
    "data": "الخوارزميات هي إجراءات خطوة بخطوة لحل المشاكل. إنها أساسية في علوم الحاسوب والبرمجة",
    "category": "البرمجة",
    "details": "الخوارزميات هي مجموعات من التعليمات أو القواعد التي تصف كيفية حل مشكلة معينة أو أداء مهمة معينة. يُستخدمون في تطبيقات مختلفة، بدءًا من الفرز والبحث وصولاً إلى تعلم الآلة والتشفير. فهم الخوارزميات أمر أساسي لكتابة الشفرة الفعالة وحل المشاكل المعقدة."
  },
  {
    "id": 8,
    "title": "أساسيات Python",
    "data": "Python هي لغة برمجة مترجمة عالية المستوى تشتهر ببساطتها وقراءتها السهلة. تستخدم على نطاق واسع في مجالات مختلفة مثل تطوير الويب وعلوم البيانات والذكاء الاصطناعي",
    "category": "البرمجة",
    "details": "تم إنشاء Python بواسطة جيدو فان روسوم وطُرحت لأول مرة في عام 1991. تم تصميمها لتكون سهلة القراءة والكتابة، بناءً على بناء جملة مفهومة وواضحة. غالبًا ما يُستخدم Python لتطوير الويب وتحليل البيانات والحوسبة العلمية والذكاء الاصطناعي وتعلم الآلة. لديها مجتمع كبير ونشط من المطورين وبيئة غنية من المكتبات والإطارات."
  },
  {
    "id": 9,
    "title": "مفاهيم تعلم الآلة",
    "data": "تعلم الآلة هو جزء من الذكاء الاصطناعي يركز على تمكين الحواسيب من التعلم من البيانات والتحسين مع مرور الوقت بدون برمجة صريحة",
    "category": "الذكاء الاصطناعي",
    "details": "التعلم الآلي هو فرع من الذكاء الاصطناعي يركز على تطوير الخوارزميات التي يمكنها التعلم من البيانات والقيام بتوقعات أو اتخاذ قرارات دون تدخل برمجي صريح. يعتمد التعلم الآلي على البيانات لتحليل الأنماط واكتساب الخبرة، مما يؤدي إلى تحسين الأداء مع مرور الوقت. يتم استخدام التعلم الآلي في مجموعة متنوعة من التطبيقات، بما في ذلك التعرف على الصور، ومعالجة اللغة الطبيعية، وأنظمة التوصية، والمركبات الذاتية القيادة، وغير ذلك الكثير."
  },
  {
    "id": 10,
    "title": "مقدمة في قواعد البيانات",
    "data": "قواعد البيانات هي نظم لتخزين وإدارة واسترداد البيانات. إنها أساسية للتطبيقات التي تتطلب تخزين البيانات المستمر",
    "category": "إدارة قواعد البيانات",
    "details": "قواعد البيانات هي أنظمة مصممة لتخزين وإدارة واسترجاع البيانات بكفاءة. إنها أساسية للتطبيقات التي تحتاج إلى تخزين كميات كبيرة من البيانات المنظمة واسترجاعها بسرعة. تأتي قواعد البيانات في أنواع مختلفة، بما في ذلك قواعد البيانات العلائقية (مثل MySQL و PostgreSQL)، وقواعد البيانات غير العلائقية (مثل MongoDB و Cassandra)، وقواعد البيانات في الذاكرة (مثل Redis). فهم قواعد البيانات أمر أساسي لبناء تطبيقات قابلة للتوسع والموثوقة."
  }
]
